Автоматизированная_проверка_конфигураций_демо/src/InformationRegisters/ИС_ЗаданияПроверки/ИС_ЗаданияПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИС_ЗаданияПроверки</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ИС_СостоянияЗадачПроверок</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автоматизированная_проверка_конфигураций_демо/src/Enums/ИС_СостоянияЗадачПроверок/ИС_СостоянияЗадачПроверок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИС_СостоянияЗадачПроверок</name>
  <enumValues>
    <name>ВОчереди</name>
  </enumValues>
  <enumValues>
    <name>ВыполняетсяПроверка</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

Автоматизированная_проверка_конфигураций_демо/src/InformationRegisters/ИС_ЗаданияПроверки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьТекущийНомерЗадания() Экспорт
	
	Возврат Константы.ИС_НомераЗаданийПроверки.Получить();
	
КонецФункции

Функция ПолучитьНаборЗаписей(СтруктураПараметров) Экспорт
	НаборЗаписей = РегистрыСведений.ИС_ЗаданияПроверки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НомерЗадания.Установить(СтруктураПараметров["НомерЗадания"]);
	НаборЗаписей.Отбор.Конфигурация.Установить(СтруктураПараметров["Конфигурация"]);
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей;
КонецФункции

Процедура УстановитьУправляемуюБлокировку(НомерЗадания) Экспорт
	Блокировка = Новый БлокировкаДанных;
	
	ИмяРегистра = "РегистрСведений.ИС_ЗаданияПроверки";
	ЭлементБлокировки = Блокировка.Добавить(ИмяРегистра);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("НомерЗадания", Новый Диапазон(Неопределено, НомерЗадания));
	
	Блокировка.Заблокировать();
КонецПроцедуры

Процедура УвеличитьНомерЗадания(НомерЗадания) Экспорт
	Константы.ИС_НомераЗаданийПроверки.Установить(НомерЗадания + 1);		
КонецПроцедуры

Функция ПолучитьКонфигурацииИзОчереди(НомерЗадания) Экспорт
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИС_ЗаданияПроверки.Конфигурация КАК Конфигурация
		|ИЗ
		|	РегистрСведений.ИС_ЗаданияПроверки КАК ИС_ЗаданияПроверки
		|ГДЕ
		|	ИС_ЗаданияПроверки.НомерЗадания <= &НомерЗадания
		|	И ИС_ЗаданияПроверки.Состояние = &Состояние";
	
	Запрос.УстановитьПараметр("НомерЗадания", НомерЗадания);
	Запрос.УстановитьПараметр("Состояние", Перечисления.ИС_СостоянияЗадачПроверок.ВОчереди);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Добавить(ВыборкаДетальныеЗаписи.Конфигурация);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура УстановитьСтатусВыполняется(МассивКонфигураций, НомерЗадания) Экспорт
	Для каждого Конфигурация из МассивКонфигураций Цикл
		НаборЗаписей = РегистрыСведений.ИС_ЗаданияПроверки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Конфигурация.Установить(Конфигурация);
		НаборЗаписей.Прочитать();
		
		Для каждого Запись из НаборЗаписей Цикл
			Если Запись.Состояние = Перечисления.ИС_СостоянияЗадачПроверок.ВОчереди 
				И Запись.НомерЗадания <= НомерЗадания Тогда
				
				Запись.Состояние = Перечисления.ИС_СостоянияЗадачПроверок.ВыполняетсяПроверка;	
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры


Процедура УстановитьСтатусЗавершено(МассивКонфигураций, НомерЗадания) Экспорт
	Для каждого Конфигурация из МассивКонфигураций Цикл
		НаборЗаписей = РегистрыСведений.ИС_ЗаданияПроверки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Конфигурация.Установить(Конфигурация);
		НаборЗаписей.Прочитать();
		
		Для каждого Запись из НаборЗаписей Цикл
			Если Запись.Состояние = Перечисления.ИС_СостоянияЗадачПроверок.ВыполняетсяПроверка
				И Запись.НомерЗадания <= НомерЗадания Тогда
				
				Запись.Состояние = Перечисления.ИС_СостоянияЗадачПроверок.Завершено;	
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры


#КонецОбласти

#КонецЕсли
